## Plan changes
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 14 to add, 6 to change, 6 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.forms_s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "forms_s3"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.template_file.form_viewer_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "form_viewer_task"  {
      ~ id       = "64fb841e056fbd7237e3df4023e71fb6a65d77135c0183ce0d6fad378e9bb9c9" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATES_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Templates"
                        },
                      - {
                          - name  = "ORGANISATIONS_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Organisations"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-staging.cdssandbox.xyz"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.uwpetx.ng.0001.cac1.cache.amazonaws.com"
                        },
                    ]
                  - image            = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_staging"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-nV4keR"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_id-wRtgIh"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_secret-tePLmK"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ template = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (6 unchanged elements hidden)
                        {
                            name  = "REDIS_URL"
                            value = "${redis_url}"
                        },
                      + {
                          + name  = "RELIABILITY_FILE_STORAGE"
                          + value = "${reliability_file_storage}"
                        },
                    ]
                    # (6 unchanged elements hidden)
                },
            ]
        )
      ~ vars     = {
          + "reliability_file_storage" = (known after apply)
            # (15 unchanged elements hidden)
        }
    }

  # aws_ecs_task_definition.form_viewer must be replaced
-/+ resource "aws_ecs_task_definition" "form_viewer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:687401027353:task-definition/form-viewer:218" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-staging.cdssandbox.xyz"
                        },
                      - {
                          - name  = "ORGANISATIONS_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Organisations"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.uwpetx.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATES_API"
                          - value = "arn:aws:lambda:ca-central-1:687401027353:function:Templates"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_staging"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - mountPoints      = []
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-nV4keR"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_id-wRtgIh"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:google_client_secret-tePLmK"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "form-viewer" -> (known after apply)
      ~ revision                 = 218 -> (known after apply)
        tags                     = {
            "CostCentre" = "Forms"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.forms_s3 will be created
  + resource "aws_iam_policy" "forms_s3" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "formsS3Access"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.lambda_s3 will be created
  + resource "aws_iam_policy" "lambda_s3" {
      + arn         = (known after apply)
      + description = "IAM policy for storing files in S3"
      + id          = (known after apply)
      + name        = "lambda_dynamobdb"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_lambda_function.load_testing will be updated in-place
  ~ resource "aws_lambda_function" "load_testing" {
        id                             = "LoadTesting"
      ~ last_modified                  = "2021-07-20T16:51:08.799+0000" -> (known after apply)
      ~ source_code_hash               = "iKN8j3Kq4C+GFb0Jf6e4i0QB43RdNXkFPSR2ZfGj2+c=" -> "rf3NAx+8dyh+Rp8EIy7SO1fXk29QuRo1K0IU1F2nPbc="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.organisations will be updated in-place
  ~ resource "aws_lambda_function" "organisations" {
        id                             = "Organisations"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:organisations_node_packages:1",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_lib_packages:7",
          - "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:8",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.retrieval will be updated in-place
  ~ resource "aws_lambda_function" "retrieval" {
        id                             = "Retrieval"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages:3",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:submission_node_packages:4",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.templates will be updated in-place
  ~ resource "aws_lambda_function" "templates" {
        id                             = "Templates"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:templates_node_packages:3",
        ] -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.organisations_lib must be replaced
-/+ resource "aws_lambda_layer_version" "organisations_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:organisations_node_packages:1" -> (known after apply)
      ~ created_date                = "2021-07-13T19:14:04.495+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:organisations_node_packages:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:organisations_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "QO1V+FhaIkZjr6Sl850U1vEKTXny0o1rGzhWUbBXbkw=" -> "48EJ84qpIym5jelu9uB98J+dCWlegI822XLuZb1ncP0=" # forces replacement
      ~ source_code_size            = 2483467 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.reliability_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:8" -> (known after apply)
      ~ created_date                = "2021-06-30T21:04:00.285+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:reliability_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "O8thUBp7GpSWqrGqTOHFIOLIUD8VPW1x+7pv0uo5LdU=" -> "O1zUVLrt272O2lx+6wJ+Bk0Zrza4N0WWVfEX4UoWsAU=" # forces replacement
      ~ source_code_size            = 13661655 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.retrieval_lib must be replaced
-/+ resource "aws_lambda_layer_version" "retrieval_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages:3" -> (known after apply)
      ~ created_date                = "2021-06-28T19:53:44.191+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:retrieval_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "RvSAqGag7CLOZltsLTfxoXP+3wBhARo6PjRibsXSP30=" -> "qcHId9Wnzl7ceyjE5U6ggZpbWencqEGKHx4OP0LSAx4=" # forces replacement
      ~ source_code_size            = 3316708 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.submission_lib must be replaced
-/+ resource "aws_lambda_layer_version" "submission_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:submission_node_packages:4" -> (known after apply)
      ~ created_date                = "2021-04-29T12:58:47.849+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:submission_node_packages:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:submission_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "51vLtKdfwIEdnPUHX/lC01ol1wk+LX9kaGerlVkbjgU=" -> "1ARs9b+tsfyvs0fVLZZD65WBYoowJENJqyCGclujT+w=" # forces replacement
      ~ source_code_size            = 3263905 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.templates_lib must be replaced
-/+ resource "aws_lambda_layer_version" "templates_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:templates_node_packages:3" -> (known after apply)
      ~ created_date                = "2021-06-29T16:11:14.218+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:templates_node_packages:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:templates_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "l1lxGU/o2C15AooV3dMWSp7XVXB2tnX6151tAaMh0Fc=" -> "abA8dRapPg32CDFgXsq6VHV5IWNMypeQKz8lRY0qZHo=" # forces replacement
      ~ source_code_size            = 2403413 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_bucket.archive_storage will be created
  + resource "aws_s3_bucket" "archive_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "forms-staging-archive_storage"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 30
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.reliability_file_storage will be created
  + resource "aws_s3_bucket" "reliability_file_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "forms-staging-reliability_file_storage"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 5
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.vault_file_storage will be created
  + resource "aws_s3_bucket" "vault_file_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "forms-staging-vault_file_storage"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.archive_storage will be created
  + resource "aws_s3_bucket_public_access_block" "archive_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.reliability_file_storage will be created
  + resource "aws_s3_bucket_public_access_block" "reliability_file_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.vault_file_storage will be created
  + resource "aws_s3_bucket_public_access_block" "vault_file_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 14 to add, 6 to change, 6 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>